GT2/GT2/RANS/KE_LienCubic_lowRE/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
	type 	fixedValue;
	value	uniform (1 0 0);
    }

    outlet
    {
	type 	zeroGradient;	
    }

    top
    {
	type 	zeroGradient;
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }

    frontandback
    {
	type	empty;
    }

}

// ************************************************************************* //
