GT2/GT2/RANS/KE_LienCubic_lowRE/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type 		zeroGradient;
    }

    outlet
    {
        type         	fixedValue;
	value 		uniform 0;
    }

    top
    {
        type 		zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
    slipsurface
    {
        //type            zeroGradient;
        type            slip;
    }
    frontandback
    {
	type	empty;
    }
}

// ************************************************************************* //
